# 1. Создать программно файл в текстовом формате,
# записать в него построчно данные, вводимые пользователем.
# Об окончании ввода данных свидетельствует пустая строка.

# f = open("test.txt", "w")
# while True:
#     s = str(input("введите текст: "))
#     if not s:
#         break
#     f.write(s + '\n')

name = 'Bond'
def soundbite(from_outside):
    insider = 'James'
    outsider = from_outside
    print(from_outside, insider, outsider)

soundbite(name) 





